#!/usr/bin/env python
# -*- coding: UTF-8 -*

def phone_information():
    phone_info= """
    ┍———————————————————————————————————————————-—┑
    │         ========主菜单========               | 
    │         1 话机信息                           
    │         2 测试用例                              
    │         3 查看日志                              
    │         4 退出当前系统                           
    │         =====================                   
    │        说明：通过数字或者↑↓方向键选择菜单           
    ┕————————————————————————————————————————————┙
    """
    print(phone_info)
phone_information()